package com.oliveoa.controller;

/**
 *  ClassName： DocumentService
 *  Description： 公文流转
 *  @Author： Erica
 */
public class DocumentService {

    /**
     *  拟稿（）
     */


    /**
     *  获取我拟稿的公文（）
     */


    /**
     *  获取待核稿的公文（）
     */


    /**
     *  核稿（）
     */


    /**
     *  获取已经核稿的公文（）
     */



    /**
     *  获取待签发的公文（）
     */


    /**
     *  签发（）
     */


    /**
     *  获取已经签发的公文（）
     */



    /**
     *  获取待签收的公文（）
     */



    /**
     *  签收（）
     */


    /**
     *  获取已经签收的公文（）
     */


    /**
     *  获取待办理的公文（）
     */


    /**
     *  办理公文（）
     */


    /**
     *  获取已经办理的公文（）
     */


    /**
     *  获取公文详情（）
     */


    /**
     *  获取全部公文（）
     */


    /**
     *  下载文件接口（）
     */
}
